tests/http/checkout-test-adyen-com-v41-payments-ok.http

HTTP/1.1 200 OK
Date: Thu, 07 Mar 2019 08:59:38 GMT
Server: Apache
Set-Cookie: JSESSIONID=95AEF49A2D6F9436CF6CCE8CB2227765.test104e; Path=/checkout; Secure; HttpOnly
pspReference: 8815519491789556
Connection: close
Transfer-Encoding: chunked
Content-Type: application/json;charset=UTF-8

{"resultCode":"RedirectShopper","details":[{"key":"payload","type":"text"}],"paymentData":"Ab02b4c0!BQABAgCy0TDX\/9BfcoeH2mzG\/l0gYzY\/Ro9xFhB0wvWt5NM\/W6wGr85EkXnv88Ria7ZieTF9xWjch5hwgqT+HDGbefkHH5qgPf\/FcncGqIjpsus+lyDlap9a+u60hbH7o7k+hFxLamQtwu+eJHnxUgqNHpeAAcuUiGmnjLA4qXohPainkWhvu5MIrWziwfWlysAeY4j7t8u+vqW+UCaM1epV0nsyIs24ncb3KG0Qr2\/4Guuk8g0A7F9zGnh+RosbX6x0Kmzc+qsQbB4P6gCn\/8B7btfNbt1lWcRV52qs3PLvM0xfIsEqUnP3inczKljfaTpOMMhYEP+QdInaZt+cV6PsHjKpJ0wgOKYYj6JmcvrfxDjQb+KrnQkqrfT\/iVgRvKO+DGx5mmodUVjH0MmSlWpQE0nzekiANbi23p3097ownPYnefzTuF\/jxFiJU9mw1Atc4AvN6\/Xpe4Rn34Tr7f\/N3vb2eU7dbusH4725DH7iAy9\/2xt7DJ0Y+iRuThZ7fcDcC1YSqtTk1JjPT6MKvcw8CdHaIAFPmLLs9rTAiLp04ZjxjAq906oCXheKjgUoOnDVF5CmvtC7zIjlnuyg0JCQxqJL2iTvHZwJpcAsf0UYeV8ZfkJxfiI9ZNWjBOxnEwOZalthxSaqhBWPcAQ4yT4D0Pka4Dd3VbHG4UjoW70Mucu\/3RDYvgr14vVAmYgRhoL6xSp2AEp7ImtleSI6IkFGMEFBQTEwM0NBNTM3RUFFRDg3QzI0REQ1MzkwOUI4MEE3OEE5MjNFMzgyM0Q2OERBQ0M5NEI5RkY4MzA1REMifX\/dco2KsKU93pnY1XhxYmnfp0R8iE6DjVrvJDAp6545UMoII0uFddEWlMz1XzhVbY6MAJ3IoAgN2C7zEmDQkK+3VlE2WL9QRCMf9ZrnWG3rGjnXCQmuIqbMyUM7Pwbo49mZk92Ro0n45rnSvzEpCsR1lzK2445GC7YKRbqYj\/pdQ1rcuVsrsHqt\/ELtwGxNBbgVg7uJIZNKH4B+4kj2nWIZYUBL\/SFe+4p7qtPOr0r5jxD0kJWkvP+UOBKJl8krw1sM3nKOjQ3NvVRemf8NV9qlfCJ16IOLERWtv8vBHkXSYMzduCXHAf3VZ\/gh2r5r9ut7qPWriqi2uOhwRD8+CjjF6Sbfd1pURK2d488xcpyNNHvcdBX6xV4t5ZZ2DZvXkpww1JRdmMuKIZpiu307U5xGAFjeRyAZF9MqDcKcniZ12vltSQ0k6ztVAo8jc44FRt8ydp6JrzPu0GfQFYOdEf9gOtpLra+72SalNEepsyfegNtrfZvyMaHfq1BfNQoVChlsn7855KWxkKoa3CMCu1f\/UBgM\/2L0v+SkUQrznUwnb5fm78fYnQmHuK4ttTGwQ\/BbNPbpMKKnssLFDvOXh0844cCiruAS9AqAM9nbp5D9FFGEVY2eW0FPOtiI5\/WqVE1DrEmzPVolxwolNxkDAXWddE6prqUXiPbyl4YeTHRq86LmdqWOmq87XEZGmGjm78DpjUgr+hD0iVl8uWyS+qxs7vzw5NfdrX+Km64cCciK1HNs+4DBCcXSRUMfaj0G8WLgVe26Iw4JYsTcPUIyAXa0WPNc3N5h\/bO919aXVk3tBg0MuAhGaEfoAGvPFf5KyaDGR2AMKplzxQyz8gbuEU\/0YjdF93TCTvZvpcLmyM+vu7tILkw1PgCUdYYhcau72dRBHcKDSrPz4tE82J20kcPfW80bnFzhyBGDWzanTwZj\/7tUYNVHdpTiCNZtXh4s+JJadp6CD1I=","redirect":{"method":"GET","url":"https:\/\/test.adyen.com\/hpp\/redirectIdeal.shtml?brandCode=ideal&countryCode=NL¤cyCode=EUR&issuerId=1121&merchantAccount=PronamicNL&merchantIntegration.type=CHECKOUT_GENERIC&merchantIntegration.version=41&merchantReference=765&merchantReturnData=8815519491789556&merchantSig=uEq1%2BLw%2FJ4%2FDKq2zJj1dQhyADpcDlOffbE5W7SIkR10%3D&paymentAmount=5000&resURL=https%3A%2F%2Fcheckoutshopper-test.adyen.com%2Fcheckoutshopper%2Fservices%2FPaymentIncomingRedirect%2Fv1%2FlocalPaymentMethod%3FmerchantAccount%3DPronamicNL%26returnURL%3Dhttp%253A%252F%252Fpay.test%252F%253Fpayment%253D765%2526key%253Dpay_5c80dd7a0bcf0&sessionValidity=2019-03-07T09%3A59%3A38Z&shopper.firstName=Remco&shopper.gender=UNKNOWN&shopper.lastName=Tolsma&shopperLocale=nl_NL&shopperStatement=Test+1551949178&shopperType=2&skinCode=pub.v2.8215464246833092.y0m88oq31fauZ5fgYASXJWSVV121FbT1RSTSnBF9-0c"}}
